app/controllers/docs_controller.rb

SELECT "docs".* FROM "docs"  ORDER BY created_at DESC
---
    def index
        @docs = Doc.all.order("created_at DESC")

INSERT INTO "docs" ("title", "content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "Mo's test "], ["content", "Blaa blaa blaa"], ["user_id", 1], ["created_at", "2016-09-09 11:43:42.424892"], ["updated_at", "2016-09-09 11:43:42.424892"]]
---
    def create
        @doc = current_user.docs.build(doc_params)

        if @doc.save

UPDATE "docs" SET "content" = ?, "updated_at" = ? WHERE "docs"."id" = ?
---
    def update
        if @doc.update(doc_params)

SELECT  "docs".* FROM "docs" WHERE "docs"."id" = ? LIMIT 1  [["id", 3]]
---
    def find_doc
        @doc = Doc.find(params[:id])